{ pkgs, lib, ... }:

let
  welcomeScript = pkgs.writeShellScriptBin "welcome-msg" ''
    # lolcat 이 있는지 확인 (Nix 패키지에서 가져옴)
    LOLCAT="${pkgs.lolcat}/bin/lolcat"

    function is_ssh() {
      [[ -n "$SSH_CLIENT" || -n "$SSH_TTY" || -n "$SSH_CONNECTION" ]] || \
      [[ "$(ps -o comm= -p $PPID 2>/dev/null)" == "sshd" ]]
    }

    if [[ -n "$ZELLIJ" ]] || is_ssh; then
      printf "\e[?7l" # 줄바꿈 제한 해제 (이미지 깨짐 방지)
      
      os_name="Linux"
      if [[ -f /etc/os-release ]]; then
        os_name=$(grep PRETTY_NAME /etc/os-release | cut -d '"' -f2)
      fi

      {
        if is_ssh; then
          cat << 'EOF'
 ███                         █████                         █████     
░░░███                      ░░███                         ░░███      
  ░░░███          █████ ████ ░███████       █████   █████  ░███████  
    ░░░███       ░░███ ░███  ░███░░███     ███░░   ███░░   ░███░░███ 
     ███░         ░███ ░███  ░███ ░███    ░░█████ ░░█████  ░███ ░███ 
   ███░           ░███ ░███  ░███ ░███     ░░░░███ ░░░░███ ░███ ░███ 
 ███░             ░░███████  ████ █████    ██████  ██████  ████ █████
░░░       ██████   ░░░░░███ ░░░░ ░░░░░    ░░░░░░  ░░░░░░  ░░░░ ░░░░░ 
         ░░░░░░    ███ ░███                                          
                  ░░██████                                           
                   ░░░░░░
EOF
        else
          cat << 'EOF'
 ███                 █████ █████                              ██████   ██████  ███                                  ███ 
░░░███              ░░███ ░░███                              ░░██████ ██████  ░░░                                  ░░░  
  ░░░███             ░░███ ███    ██████  ████████    ███████ ░███░█████░███  ████  ████████    ██████   ████████  ████ 
    ░░░███            ░░█████    ███░░███░░███░░███  ███░░███ ░███░░███ ░███ ░░███ ░░███░░███  ░░░░░███ ░░███░░███░░███ 
     ███░              ░░███    ░███ ░███ ░███ ░███ ░███ ░███ ░███ ░░░  ░███  ░███  ░███ ░███   ███████  ░███ ░░░  ░███ 
   ███░                 ░███    ░███ ░███ ░███ ░███ ░███ ░███ ░███      ░███  ░███  ░███ ░███  ███░░███  ░███      ░███ 
 ███░      █████████    █████   ░░██████  ████ █████░░███████ █████     █████ █████ ████ █████░░████████ █████     █████
░░░       ░░░░░░░░░    ░░░░░     ░░░░░░  ░░░░ ░░░░░  ░░░░░███░░░░░     ░░░░░ ░░░░░ ░░░░ ░░░░░  ░░░░░░░░ ░░░░░     ░░░░░ 
                                                     ███ ░███                                                           
                                                    ░░██████                                                            
                                                     ░░░░░░                                                             
EOF
        fi

        echo " $os_name"
        echo " HOST      : $(uname -n)"
        echo " SESSION   : $([[ -n "$ZELLIJ" ]] && echo "Zellij" || echo "Remote SSH")"
        echo " Kernel    : $(uname -r)"
        echo " Date      : $(date +'%Y-%m-%d %H:%M:%S')"
        echo " Who       : $(whoami)"
      } | $LOLCAT

      echo -e "\nWelcome back to \x1b[94mShell\x1b[0m, \x1b[1m$USER!\x1b[0m"
      printf "\e[?7h" # 다시 켜기
    fi
  '';
in
{
  home.packages = [ welcomeScript pkgs.lolcat ];
}
